Grasshopper.Kernel.GH_DocumentIO.ShowOverwriteProtection
Gets or sets whether the file overwrite protection dialog ought to be
shown during risky saves.

Grasshopper.Kernel.GH_DocumentIO.ShowOverwriteWarningIfNeeded(System.String)
Show the overwrite warning dialog if the cached file time and the disk file time
disagree. Also, for this function to do anything at all the Grasshopper.Kernel.GH_DocumentIO.ShowOverwriteProtection
property must be set to TRUE.