GH_IO.Serialization.ID
An ID is used to uniquely identify a specific item.

GH_IO.Serialization.ID.#ctor(System.String)
Constuctor for IDs.
name: Name of id.

GH_IO.Serialization.ID.#ctor(System.String,System.Int32)
Constructor for IDs.
name: Name of id.
index: Index of id. Valid values are:
-1 = no index
0 to int.MaxValue = valid index

GH_IO.Serialization.ID.Name
Gets the name of this ID.

GH_IO.Serialization.ID.HasName
Gets whether the name has been set.
Every valid ID must have a name.

GH_IO.Serialization.ID.Index
Gets the index of this ID, if there is no valid index then -1 is returned.

GH_IO.Serialization.ID.HasIndex
Gets whether the index has been set.

GH_IO.Serialization.ID.Hash
Gets the hash code.

GH_IO.Serialization.ID.GetHashCode
Gets the hash code.
Returns: A number representing the hash code.

GH_IO.Serialization.ID.CompareTo(GH_IO.Serialization.ID)
Compares this ID to another ID.
other: The other ID.
Returns: Less than 0, if other comes before this. 0 is other is at the same place. More than zero otherwise.

GH_IO.Serialization.ID.Equals(GH_IO.Serialization.ID)
Determines if two IDs are equal.
other: The other ID.
Returns: true is both are equal.

GH_IO.Serialization.ID.ToString
Gets a string representation for this ID.