GH_IO.VersionNumber.Branch
Build branch, set by the build process.

GH_IO.VersionNumber.Branch.Unset
Uninitialized value.

GH_IO.VersionNumber.Branch.Developer
Private developer build; should never be released to the public.

GH_IO.VersionNumber.Branch.Trunk
Mainline trunk build. May be released to the public.

GH_IO.VersionNumber.Branch.ReleaseCandidate
Release candidate build. Will be released to the public.

GH_IO.VersionNumber.Branch.Release
Final Release build. Will be released to the public.