GH_IO.Types.GH_Item.#ctor(System.String,System.Double[])
Construct a new instance of GH_Item with the specified name and value.
item_name: Name of new item.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item.#ctor(System.String,System.Int32,System.Double[])
Construct a new instance of GH_Item with the specified name, index and value.
item_name: Name of new item.
item_index: Index of new item. Any index less than zero will be clamped to -1.
item_data: Value of new item.
Throws System.ArgumentNullException: Thrown if the specified name string is null or empty.

GH_IO.Types.GH_Item._doublearray
Returns the internal data of this item cast to a Byte array.
If the data is not stored as a Byte array, a conversion exception might be thrown.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.