GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection
Represents a collection of chunks with associated IDs

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.#ctor
Create a new collection.

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.Count
Returns the amount in the collection.

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.Add(GH_IO.Serialization.GH_Chunk)
Adds a new chunk.
chunk: The chunk to be added.

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.Remove(GH_IO.Serialization.GH_Chunk)
Removes a chunk.
chunk: The chunk to be removed.
Returns: True if the operation was successful; false otherwise.

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.Remove(GH_IO.Serialization.ID)
Removes an ID.
id: The ID to be removed.
Returns: True if the operation was successful; false otherwise.

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.Clear
Removes all chunks from the collection.

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.TryGetValue(GH_IO.Serialization.ID,GH_IO.Serialization.GH_Chunk@)
Try and find the chunk that belongs to a given ID.
id: ID to look for.
chunk: Chunk result.
Returns: True is a chunk was found, false if otherwise.

GH_IO.Serialization.GH_Chunk.ChunkKeyedCollection.GetEnumerator
Gets an enumerator that iterates over all chunks in the collection.
Returns: The enumerator.