GH_IO.Serialization.GH_Archive.AddMessage(System.String,GH_IO.Serialization.GH_Message_Type)
Add a new message to the record.
messageText: Message text.
messageType: Message type.
Throws System.ArgumentNullException: Thrown if message text is null or empty.

GH_IO.Serialization.GH_Archive.CreateTopLevelNode(System.String)
Creates and returns a new root node for this archive in the form of a GH_IWriter instance.
Typically you do not call this method. If you want to add an object to the archive, use AppendObject() instead.
rootName: Name of root object.
Returns: The GH_IWriter incarnation of the GH_Chunk that represents the new Node.

GH_IO.Serialization.GH_Archive.SaveFileDialog(System.String,System.String@,System.Collections.Generic.List{System.String})
Displays a standard SaveFileDialog with all the fields set to cater for Grasshopper files.
title: Title of the dialog. If null, the default title will be used.
filePath: Path to file picked by user. If file_path represents a valid string,
the dialog is set up to match.
additionalFilters: A list of additional file format filters or null.
Filter strings must be in typical FileDialog.Filter syntax: "File Name (*.ext)|*.ext"
Returns: True is user picked a new path, False if user cancelled.

GH_IO.Serialization.GH_Archive.OpenFileDialog(System.String,System.String@,System.Collections.Generic.List{System.String})
Displays a standard OpenFileDialog with all the fields set to cater for Grasshopper files.
title: Title of the dialog. If null, the default title will be used.
filePath: Path to file picked by user.
If file_path represents a valid string,
the dialog is set up to match.
additionalFilters: A list of additional file format filters or null.
Filter strings must be in typical FileDialog.Filter syntax: "File Name (*.ext)|*.ext"
Returns: True is user picked a path, False if user cancelled.

GH_IO.Serialization.GH_Archive.AppendObject(GH_IO.GH_ISerializable,System.String)
Appends a target object into the root node of this archive tree.
If the root doesn't exist yet, it will be created. Existing objects at the root scope
will not be affected.
target: Object to append. Cannot be null.
targetName: Name of object to append, name must be unique.
Returns: True on succes, false on failure.
Throws System.ArgumentNullException: Thrown if target is a null reference.
Throws System.ArgumentNullException: Thrown if the target_name is null or empty.
This sample shows how to create a new archive and serialize a single top level object.
bool CreateFile(string file_name, GH_ISerializable target, string target_name)
{
GH_Archive archive = new GH_Archive();
archive.AppendObject(target, target_name);
return archive.WriteToFile(file_name, true);
}

GH_IO.Serialization.GH_Archive.ExtractObject(GH_IO.GH_ISerializable,System.String)
Extract a target object from the data tree.
target: Object to extract. Cannot be null.
targetName: Name of object to extract, name must identify an existing chunk.
Returns: True on succes, false on failure.
Throws System.MemberAccessException: Thrown if the Root node hasn't been instantiated yet.
Throws System.ArgumentNullException: Thrown if target is a null reference.
Throws System.ArgumentNullException: Thrown if the target_name is null or empty.
Throws System.MemberAccessException: Thrown if the target_name cannot be resolved.

GH_IO.Serialization.GH_Archive.WriteToFile(System.String,System.Boolean,System.Boolean)
Writes the current tree to a file.
fileName: Path of file to write to. If the extension is not a recognized Grasshopper extension,
an exception will be thrown.
overwrite: True to overwrite file at specified location.
rememberPath: If True, the MRU path field will be updated to reflect the new path.
Returns: True on succes, false if file already exists and overwrite is set to false.
Throws System.MemberAccessException: Thrown if the root of the current archive hasn't been instantiated yet.
Throws System.ArgumentNullException: Thrown if file_name is either null or empty.
Throws System.IO.IOException: Thrown if the file_name doesn't represent a known file extension.

GH_IO.Serialization.GH_Archive.ReadFromFile(System.String)
Reads a new archive tree from a file.
fileName: Path of file to parse.
Returns: True on success, false on failure. If the read operation fails,
all the member fields of this archive ought to be treated as invalid.
Throws System.IO.FileNotFoundException: Thrown if the file doesn't exist.
Throws System.IO.IOException: Thrown if the file_name doesn't represent a known file extension.

GH_IO.Serialization.GH_Archive.CreateTempFilePath(System.String)
Create a temporary file location.
extension: File extension, including the period.

GH_IO.Serialization.GH_Archive.WriteToFile_Xml(System.String)
Serializes the current data tree into an Xml Grasshopper file.
fileName: Path of file to write.
Returns: True on success, or throws exceptions on failure.

GH_IO.Serialization.GH_Archive.WriteToFile_Binary(System.String)
Serializes the current data tree into a Binary Grasshopper file.
fileName: Path of file to write.
Returns: True on success, or throws exceptions on failure.

GH_IO.Serialization.GH_Archive.Deserialize_Xml(System.String)
Deserializes an Xml string.
xmlContent: Xml to deserialize.
Returns: True on success, false on failure.
Throws System.Xml.XmlException: Thrown if xml_content is not a valid Grasshopper Xml stream.