GH_IO.Properties.Resources.DisplayHelp
Looks up a localized resource of type System.Drawing.Bitmap.

GH_IO.Properties.Resources.MailMessages
Looks up a localized resource of type System.Drawing.Bitmap.

GH_IO.Properties.Resources.SaveMessages
Looks up a localized resource of type System.Drawing.Bitmap.

GH_IO.Properties.Resources.SortByTime
Looks up a localized resource of type System.Drawing.Bitmap.