GH_IO.Serialization.GH_Chunk.CopyValuesFromChunk(GH_IO.Serialization.GH_Chunk)
Copy all values and sub-chunks from another chunk.

GH_IO.Serialization.GH_Chunk.CopyValuesToChunk
Copy all values and sub-chunks in this chunk to another chunk
which does not point to the same archive.

GH_IO.Serialization.GH_Chunk.ArchiveLocation
Gets a string representing the URI with which the archive is associated.
The location may be a null string.

GH_IO.Serialization.GH_Chunk.RemoveItem(System.String)
Remove an unindexed item from this chunk.
itemName: Name of item.
Returns: True on success, false on failure.

GH_IO.Serialization.GH_Chunk.RemoveItem(System.String,System.Int32)
Remove an indexed item from this chunk.
itemName: Name of item.
itemIndex: Index of item.
Returns: True on success, false on failure.

GH_IO.Serialization.GH_Chunk.m_chunks
Dictionary of sub-chunks contained within this chunk.

GH_IO.Serialization.GH_Chunk.AddChunk(GH_IO.Serialization.GH_Chunk)
Add a new chunk to the collection. Chunk must be valid.
chunk: Chunk to add.

GH_IO.Serialization.GH_Chunk.AddItem(GH_IO.Types.GH_Item)
Add an item to the items dictionary. You must make sure there is no collision and that the item is fully valid.
item: Item to add.

GH_IO.Serialization.GH_Chunk.SetPath(System.String,System.String,System.String)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
absolutePath: Absolute path to store.
basePath: Base path. This will be used to also store a relative path.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.SetPath(System.String,System.Int32,System.String,System.String)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
absolutePath: Absolute path to store.
basePath: Base path. This will be used to also store a relative path.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.MakeRelativePath(System.String,System.String)
Creates a relative path from one file or folder to another.
Method adapted from StackOverflow post:
http://stackoverflow.com/questions/275689/how-to-get-relative-path-from-absolute-path
source: Contains the directory that defines the start of the relative path.
target: Contains the path that defines the endpoint of the relative path.
Returns: The relative path from the start directory to the end path or null if no relative path could be made.
Throws System.ArgumentNullException: Thrown if either source or target is null or empty.

GH_IO.Serialization.GH_Chunk.SetDoubleArray(System.String,System.Double[])
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_Chunk.SetDoubleArray(System.String,System.Int32,System.Double[])
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_Chunk.GetPath(System.String,System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
basePath: Base path for relative path resolution.
Returns: An array of path strings. If the resolved relative path is different
from the stored absolute path, an array of two strings will be returned [absolute, relative].
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetPath(System.String,System.Int32,System.String)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
basePath: Base path for relative path resolution.
Returns: An array of path strings. If the resolved relative path is different
from the stored absolute path, an array of two strings will be returned [absolute, relative].
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.

GH_IO.Serialization.GH_Chunk.GetDoubleArray(System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetDoubleArray(System.String,System.Int32)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
Returns: The inner value of the item.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.