GH_IO.Serialization.GH_LooseChunk.#ctor(System.String,System.Int32)
Create a new loose chunk. A loose chunk does not have an owner archive
and thus cannot store runtime messages.
chunk_name: Name of this chunk.
chunk_index: Index of this chunk, negative one for no index.