GH_IO.VersionNumber
Represents a product version number that encodes major, minor, time and build branch information.
as major.minor.yyddd.hhmmb where:
yy = year of build - 2000
ddd = year day of build (1-366)
hh = hour of build
mm = minute of build
b = branch of build

GH_IO.VersionNumber.#ctor(System.Int32,System.Int32,System.DateTime,GH_IO.VersionNumber.Branch)
Initializes a new instance of the VersionNumber structure to the version specified by the parameters.
major:
The major version number (0 through 63).
minor:
The minor version number (0 through 127).
time:
The time is the version time (January 1, 2000 00:00 through December 31 23:59). Seconds are ignored.
buildBranch:
The branch used to build the product (developer, trunk, release_candidate, or release).

GH_IO.VersionNumber.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Initializes a new instance of the VersionNumber structure to the version specified by the version quartet values.
majorVersionNumber:
The major version number (0 through 63).
minorVersionNumber:
The minor version number (0 through 127)
versionQuartetYyddd:
The third version quartet value is (year - 2000)*1000 + yday, where year is 2000 to 2099 and yday is 1 to the number of days in the specified year.
versionQuartetHhmmb:
The forth version quartet value is (hour*1000 + minute*10 + branch) where hour is 0 to 23, minute is 0 to 59, and branch is 0 to 3.

GH_IO.VersionNumber.#ctor(System.Version)
Construct VersionNumber based on existing System.Version class.
version:

GH_IO.VersionNumber.CompareTo(GH_IO.VersionNumber)
Compares the value of this instance to a specified VersionNumber value and returns an integer that indicates whether this instance is earlier than, the same as, or later than the specified VersionNumber value.
value:
The object to compare to the current instance.
Returns:
A signed number indicating the relative values of this instance and the value parameter.
Less than zero indicates this instance is earier than value.
Zero indicates this instance is the same as value.
Greater than zero indicates this instance is later than value.

GH_IO.VersionNumber.CompareTo(System.Object)
Compares the value of this instance to a specified VersionNumber value and returns an integer that indicates whether this instance is earlier than, the same as, or later than the specified VersionNumber value.
value:
The object to compare to the current instance.
Returns:
A signed number indicating the relative values of this instance and the value parameter.
Less than zero indicates this instance is earier than value.
Zero indicates this instance is the same as value.
Greater than zero indicates this instance is later than value.

GH_IO.VersionNumber.Unset
The Unset VersionNumber. VersionNumber.Unset.IsValid is false.

GH_IO.VersionNumber.MinValid
The smallest possible valid VersionNumber.

GH_IO.VersionNumber.MaxValid
The largest possible valid VersionNumber.

GH_IO.VersionNumber.IsValid
True when all information in the VersionNumber has valid values.

GH_IO.VersionNumber.MinMajorVersionNumber
The smallest possible valid value of VersionNumber.MajorVersionNumber.

GH_IO.VersionNumber.MaxMajorVersionNumber
The largest possible valid value of VersionNumber.MajorVersionNumber.

GH_IO.VersionNumber.UnsetTime
The value of an Unset VersionNumber.Time.

GH_IO.VersionNumber.MinValidTime
The smallest possible valid value of VersionNumber.Time.  This field is read-only.

GH_IO.VersionNumber.MaxValidTime
The largest possible valid value of VersionNumber.Time.  This field is read-only.

GH_IO.VersionNumber.UnsetBuildBranch
The value of an Unset VersionNumber.BuildBranch.

GH_IO.VersionNumber.MinValidBuildBranch
Represents the smallest possible valid value of VersionNumber.BuildBranch.  This field is read-only.

GH_IO.VersionNumber.MaxValidBuildBranch
Represents the largest possible valid value of VersionNumber.BuildBranch.  This field is read-only.

GH_IO.VersionNumber.ToString
Converts the value of the current VersionNumber object to its equivalent string representation major.minor.yyddd.hhmmb. (Overrides ValueType.ToString().)

GH_IO.VersionNumber.ToVersion
Convert this VersionNumber class to System.Version()
Returns:

GH_IO.VersionNumber.TryParse(System.String,GH_IO.VersionNumber@)
Converts the specified string representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
s:
A string containing four integers separated by full stops in the format major.minor.yyddd.hhmmb, where yy is year-2000, ddd is the day of the year, hh is the hour, mm is the minute and b identifies the build branch.
result:
When this method returns, result contains the VersionNumber value equivalent to the version number contained in s, if the conversion succeeded, or VersionNumber.Unset if the conversion failed. The conversion fails if the s parameter is null, is an empty string (""), or does not contain a valid string representation of version number. This parameter is passed uninitialized.
Returns:

GH_IO.VersionNumber.TryParse(System.Version,GH_IO.VersionNumber@)
Attempt so convert the System.Version representation of a version number to its VersionNumber equivalent and returns a value that indicates whether the conversion succeeded.
v:
A version number with quartet values (v.Major, v.Minor, v.Build, v.Revision) that are valid ((0 to 63),(0 to 127), (1 to 99365), (0 to 23593)).
result:
When this method returns, result contains the VersionNumber value equivalent to the version number contained in v, if the conversion succeeded, or VersionNumber.Unset if the conversion failed. The conversion fails if the v parameter is null, is an empty string (""), or does not contain a valid string representation of version number. This parameter is passed uninitialized.
Returns:

GH_IO.VersionNumber.Major
Gets the major version number component of this instance.

GH_IO.VersionNumber.Minor
Gets the minor version number component of this instance.

GH_IO.VersionNumber.MinMinorVersionNumber
The smallest possible valid value of VersionNumber.MinorVersionNumber.

GH_IO.VersionNumber.MaxMinorVersionNumber
The largest possible valid value of VersionNumber.MinorVersionNumber.

GH_IO.VersionNumber.Time
Gets the version time component of this instance.

GH_IO.VersionNumber.BuildBranch
Gets the build branch component of this instance.

GH_IO.VersionNumber.VersionQuartetValue1
Gets the first version quartet value of this instance. This is the first number in the string format.

GH_IO.VersionNumber.VersionQuartetValue2
Gets the second version quartet value of this instance. This is the second number in the string format.

GH_IO.VersionNumber.VersionQuartetValue3
Gets the third version quartet value of this instance. This is the third number in the string format.

GH_IO.VersionNumber.VersionQuartetValue4
Gets the forth version quartet value of this instance. This is the forth number in the string format.