GH_IO.Serialization.GH_IWriter.RemoveItem(System.String)
Remove an unindexed item from this chunk.
itemName: Name of item.
Returns: True on success, false on failure.

GH_IO.Serialization.GH_IWriter.RemoveItem(System.String,System.Int32)
Remove an indexed item from this chunk.
itemName: Name of item.
itemIndex: Index of item.
Returns: True on success, false on failure.

GH_IO.Serialization.GH_IWriter.SetPath(System.String,System.String,System.String)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
absolutePath: Absolute path to store.
basePath: Base path. This will be used to also store a relative path.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetPath(System.String,System.Int32,System.String,System.String)
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
absolutePath: Absolute path to store.
basePath: Base path. This will be used to also store a relative path.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.

GH_IO.Serialization.GH_IWriter.SetDoubleArray(System.String,System.Double[])
Add a new data item to this chunk.
The name must be unique or an exception will be thrown.
item_name: Name of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name already exists.

GH_IO.Serialization.GH_IWriter.SetDoubleArray(System.String,System.Int32,System.Double[])
Add a new data item to this chunk.
The combination of name and index must be unique or an exception will be thrown.
item_name: Name of item to add.
item_index: Index of item to add.
item_value: Value of item to add.
Throws System.InvalidOperationException: Thrown if another item with the same name and index already exists.