Grasshopper.Kernel.GH_RenderArgs.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes,Rhino.PlugIns.PlugIn,Rhino.Render.CustomRenderMeshes.RenderMeshes)
Create new render arguments.
doc: Rhino document.
vp: Viewport.
att: The viewport display attributes.
plugIn: Render plugin.
geometry: Geometry list.
Since: 8.0