Grasshopper.Kernel.GH_Convert.ToGHDimension_Primary``2(System.Object,``0@)
Converts similar data into a GH_Dimension instance.
Data is not guaranteed to be duplicated.
data: Data to convert
target: Target instance.
Returns: True on success, False on failure.