Grasshopper.My.Resources.Res_ObjectIcons.ContentDetails_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_AndOperator_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_Contains_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_Equality_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_Intersection_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_LargerThan_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_NotOperator_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_OrOperator_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_RegEx_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_SmallerThan_24x24
Looks up a localized resource of type System.Drawing.Bitmap.

Grasshopper.My.Resources.Res_ObjectIcons.FilterRules_Union_24x24
Looks up a localized resource of type System.Drawing.Bitmap.